app/controllers/follows_controller.rb

  def index
    @follows = Follow.all
---
SELECT * FROM `follows`