app/controllers/logs_controller.rb

SELECT * FROM `logs` ORDER BY created_at desc LIMIT 30
---
  def index
    @logs = Log.all(:order=>"created_at desc",:limit=>30)