app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT * FROM `questions`

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)

  def create
    #1.save the question
    @question = Question.new(params[:question])
     respond_to do |format|
    if @question.save
      #2.create a follow
      follow = Follow.new
      follow.question_id = @question.id
      follow.user_id = current_user.id
      follow.save
---
INSERT INTO `questions` (`min_title`, `category`, `updated_at`, `from`, `url`, `original_url`, `sort_id`, `is_display`, `max_title`, `created_at`) VALUES('这是月经麽', 1, '2010-05-30 05:38:10', 1, '152168913.html', NULL, 1, 1, NULL, '2010-05-30 05:38:10')
INSERT INTO `follows` (`updated_at`, `question_id`, `user_id`, `created_at`) VALUES('2010-05-30 04:06:04', 16, 1, '2010-05-30 04:06:04')

  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 3)
UPDATE `questions` SET `updated_at` = '2010-06-03 00:58:17', `min_title` = '\r\n这是月经麽' WHERE `id` = 1

  def destroy
    @question = Question.find(params[:id])
    @question.destroy
---
SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
DELETE FROM `questions` WHERE `id` = 1