app/controllers/users_controller.rb

  def show
    @user = self.current_user || User.find(params[:id])
    @follows = Follow.all(:conditions=>["user_id = ?",@user.id],:order=>"created_at DESC")
---
SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT * FROM `follows` WHERE (user_id = 2) ORDER BY created_at DESC

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO `users` (`salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `sex`, `remember_token`, `login`, `email`, `created_at`) VALUES('707153e522d316831c9ad570f2a2e552f3efca40', '2010-05-24 12:23:48', 'd1775e9762a6c3df2d8861421fd0cb6ec79b0642', NULL, NULL, NULL, 'kenrome', 'kenrome@163.com', '2010-05-24 12:23:48')