app/controllers/welcome_controller.rb

SELECT * FROM `logs` ORDER BY created_at DESC LIMIT 20
---
  def index
    from = params[:from]
    @arr = []
    if from=="1"  #load from zhidao.baidu.com
      @arr =load_from("http://zhidao.baidu.com/browse/?lm","table#tl","http://zhidao.baidu.com","gb2312")
    elsif from=="2" #load from tianya.com
      @arr =load_from("http://wenda.tianya.cn/wenda/?tab=wtmtoc#wtmtc","div.wvtpCSS table.wpr2trCSS","http://wenda.tianya.cn",nil)
    elsif from=="3" #load from soso
      @arr =load_from("http://wenwen.soso.com/z/TopQuestion.e?sp=5","ul.question_list1","http://wenwen.soso.com",nil)
    elsif from=="4" #load from sogou
      @arr =load_from("http://wenda.sogou.com/cate/0.html?s=2","table.alist","","gbk")
    elsif from=="5" #load from iask.sina.com.cn
      @arr =load_from("http://iask.sina.com.cn/rank/finish_question.php","table","http://iask.sina.com.cn","gbk")
    elsif from=="6" #load from yahoo
      @arr =load_from("http://ks.cn.yahoo.com/dir/over.html","div.mqlist div.bd","http://ks.cn.yahoo.com",nil)
    else
       @logs = Log.all(:order=>"created_at desc",:limit=>30)